export const stationDistanceList = [
  ["교대", "강남", 2],
  ["교대", "남부터미널", 3],
  ["강남", "교대", 2],
  ["강남", "역삼", 2],
  ["강남", "양재", 2],
  ["역삼", "양재", 2],
  ["남부터미널", "교대", 3],
  ["남부터미널", "양재", 6],
  ["양재", "강남", 2],
  ["양재", "남부터미널", 6],
  ["양재", "매봉", 1],
  ["양재", "양재시민의숲", 10],
  ["매봉", "양재", 1],
  ["양재시민의숲", "양재", 10],
];

export const stationMinuteList = [
  ["교대", "강남", 3],
  ["교대", "남부터미널", 2],
  ["강남", "교대", 3],
  ["강남", "역삼", 3],
  ["강남", "양재", 8],
  ["역삼", "양재", 3],
  ["남부터미널", "교대", 2],
  ["남부터미널", "양재", 5],
  ["양재", "강남", 8],
  ["양재", "남부터미널", 5],
  ["양재", "매봉", 1],
  ["양재", "양재시민의숲", 3],
  ["매봉", "양재", 1],
  ["양재시민의숲", "양재", 3],
];

export const stationDistanceMap = {
  교대: { 강남: 2, 남부터미널: 3 },
  강남: { 교대: 2, 역삼: 2, 양재: 2 },
  역삼: { 강남: 2 },
  남부터미널: { 교대: 3, 양재: 6 },
  양재: { 강남: 2, 남부터미널: 6, 매봉: 1, 양재시민의숲: 10 },
  매봉: { 양재: 1 },
  양재시민의숲: { 양재: 10 },
};

export const stationMinuteMap = {
  교대: { 강남: 3, 남부터미널: 2 },
  강남: { 교대: 3, 역삼: 3, 양재: 8 },
  역삼: { 강남: 3 },
  남부터미널: { 교대: 2, 양재: 5 },
  양재: { 강남: 8, 남부터미널: 5, 매봉: 1, 양재시민의숲: 3 },
  매봉: { 양재: 1 },
  양재시민의숲: { 양재: 3 },
};

export const stationList = ["교대", "강남", "역삼", "남부터미널", "양재", "매봉", "양재시민의숲"];
