export const lineData = [
  {
    name: '2호선',
    distanceInfo: [
      ['교대', '강남', 2],
      ['강남', '역삼', 2],
    ],
    timeInfo: [
      ['교대', '강남', 3],
      ['강남', '역삼', 3],
    ],
  },
  {
    name: '6호선',
    distanceInfo: [['합정', '상수', 2]],
    timeInfo: [['합정', '상수', 2]],
  },
  {
    name: '3호선',
    distanceInfo: [
      ['교대', '남부터미널', 3],
      ['남부터미널', '양재', 6],
      ['양재', '매봉', 1],
    ],
    timeInfo: [
      ['교대', '남부터미널', 2],
      ['남부터미널', '양재', 5],
      ['양재', '매봉', 1],
    ],
  },
  {
    name: '신분당선',
    distanceInfo: [
      ['강남', '양재', 2],
      ['양재', '양재시민의숲', 10],
    ],
    timeInfo: [
      ['강남', '양재', 8],
      ['양재', '양재시민의숲', 3],
    ],
  },
];
