export const stationList = ["교대", "강남", "역삼", "남부터미널", "양재", "매봉", "양재시민의숲"]

export const pathWithDistance = [
  ["교대", "강남", 2],
  ["교대", "남부터미널", 3],
  ["강남", "교대", 2],
  ["남부터미널", "교대", 3],
  ["강남", "역삼", 2],
  ["역삼", "강남", 2],
  ["강남", "양재", 2],
  ["양재", "강남", 2],
  ["남부터미널", "양재", 6],
  ["양재", "남부터미널", 6],
  ["양재", "매봉", 1],
  ["매봉", "양재", 1],
  ["양재", "양재시민의숲", 10],
  ["양재시민의숲", "양재", 10]
]

export const pathWithTime = [
  ["교대", "강남", 2],
  ["교대", "남부터미널", 3],
  ["강남", "교대", 2],
  ["남부터미널", "교대", 3],
  ["강남", "역삼", 2],
  ["역삼", "강남", 2],
  ["강남", "양재", 2],
  ["양재", "강남", 2],
  ["남부터미널", "양재", 6],
  ["양재", "남부터미널", 6],
  ["양재", "매봉", 1],
  ["매봉", "양재", 1],
  ["양재", "양재시민의숲", 10],
  ["양재시민의숲", "양재", 10]
]